# Напишите программу, которая считывает натуральное число
# n(1≤n≤9) и выводит значение следующего выражения n+nn+nnn
# Формат входных данных
# На вход программе подаётся натуральное число
# Программа должна вывести значение выражения
# Примечание: Для первого теста, если n = 1, программа должна вывести 123 (1+11+111)
n = int(input())
res = n*123
print(res)
