'''Итак, предлагаем приступить к практике! Начнём с задачи, которая поможет вам закрепить навык работы с базовым синтаксисом Python для вывода текста.

Начнём с простого. Напишите программу, которая выведет текст: Привет, Яндекс!.'''

print("Привет, Яндекс!")