'''Отлично! Двигаемся дальше. Предлагаем решить следующую задачу, которая поможет вам научиться работать с функцией input() для ввода данных и форматирования строк для вывода результата.

Для этого напишите диалоговую программу, которая сначала спросит имя пользователя, а затем поприветствует его.

Формат ввода
Одна строка — имя пользователя программы.

Формат вывода:
Первая строка: вопрос «Как Вас зовут?»
Вторая строка: приветствие пользователя в формате «Привет, <имя пользователя>», где <имя пользователя> — это строка, введённая пользователем.'''

print(f'Привет, {input("Как Вас зовут? ")}')