'''Набираем обороты и решаем задачу с выводом для повторения строк.

Вы знаете два главных принципа программистов?
«Повторение — мать учения!» и «Если это можно автоматизировать — автоматизируй!»
Что будет, если их объединить?

Вы создадите программу, которая принимает одну строку и выводит её трижды, каждая строка на новой строке.

Формат ввода
Одна строка — весьма полезная информация.

Формат вывода
Трижды повторённая весьма полезная информация.


'''

print(f"{input()}\n" * 3, end="")