'''Делу — время, потехе — час

Каждому нужен отдых! Предлагаем сделать паузу от решения задач... И сделать что-то действительно интересное.

Напишите программу, которая N раз выводит строку «Купи слона!».

Формат ввода
Одно натуральное число N

Формат вывода N строк с фразой: "Купи слона!"'''

print(f"Купи слона!\n" * int(input()), end="")
