"""Вам доступна строка data. Напишите программу, которая выводит кортеж, состоящий из символов строки data.

Примечание. Считайте, что строка data уже объявлена в вашей программе, и вы имеете к ней доступ.
"""

data_tuple = tuple(data)
print(data_tuple)
