'''Старинная задача 🐮
Сколько быков, коров и телят можно купить ровно на 100 рублей, если:
плата за быка – 10 рублей,
за корову – 5 рублей,
за телёнка – 0.5 рубля 

и надо купить 100 голов скота?

Примечание. Используйте вложенный цикл for.'''

# 10 * bull + 5 * cow + 0.5 * calf = 100
# bull + cow + calf = 100 
# bull <=9,45           (100-5,5)/10  
# cow <= 17,9           (100-10,5)/5
# calf <= 170           (100-15)/0,5

for bull in range (10):
    for cow in range (18):
        for calf in range (0,171,2):
            if 10 * bull + 5 * cow + 0.5 * calf == bull + cow + calf == 100:
                print("быки - ", bull, "коровы - ", cow, "телята - ", calf) 


    