#Напишите программу, которая считывает одну строку. Если это строка «Python», программа выводит «ДА», в противном случае программа выводит «НЕТ».
text = input()
if text == "Python":
    print("ДА!")
else:
    print("НЕТ!")
