'''sWAP cASE 🔃
На вход программе подаётся строка. Напишите программу, которая меняет регистр символов – заменяет все строчные символы заглавными и наоборот.

Формат входных данных: на вход программе подаётся строка.

Формат выходных данных: программа должна вывести строку в соответствии с условием задачи.'''

s = input()
print (s.swapcase())