# 2.5 Напишите программу, которая находит полное число метров по заданному числу сантиметров.
# На вход программе подаётся натуральное число – количество сантиметров.
# Программа должна вывести одно число – полное число метров.
cm = int(input())
metres = cm // 100
print(metres)
